noblit = {
2022г.	Анни Эрно
2021г.	Абдулразак Гурна
2020г.	Луиза Глюк
2019г.	Петер Хандке
2018г.	Ольга Токарчук
2017г.	Кадзуо Исигуро
2016г.	Боб Дилан
2015г.	Светлана Алексиевич
2014г.	Патрик Модиано
2013г.	Элис Энн Манро
2012г.	Мо Янь
2011г.	Тумас Транстремер
2010г.	Марио Варгас Льоса
2009г.	Герта Мюллер
2008г.	Жан-Мари Гюстав Леклезио
2007г.	Дорис Лессинг
2006г.	Орхан Памук
2005г.	Гарольд Пинтер
2004г.	Эльфрида Елинек
2003г.	Джон Максвелл Кутзее
2002г.	Имре Кертес
2001г.	Видиадхар Сураджпрасад Найпол
2000г.	Гао Синцзянь
1999г.	Гюнтер Грасс
1998г.	Жозе Сарамаго
1997г.	Дарио Фо
1996г.	Вислава Шимборска
1995г.	Шеймус Хини
1994г.	Кэнзабуро Оэ
1993г.	Тони Моррисон
1992г.	Дерек Уолкотт
1991г.	Надин Гордимер
1990г.	Октавио Пас
1989г.	Камило Хосе Села
1988г.	Нагиб Махфуз
1987г.	Иосиф Бродский
1986г.	Воле Шойинка
1985г.	Клод Симон
1984г.	Ярослав Сейферт
1983г.	Уильям Голдинг
1982г.	Габриэль Гарсия Маркес
1981г.	Элиас Канетти
1980г.	Чеслав Милош
1979г.	Одисеас Элитис
1978г.	Исаак Башевис Зингер
1977г.	Висенте Алейксандре
1976г.	Сол Беллоу
1975г.	Эудженио Монтале
1974г.	Эйвинд Йонсон
1974г.	Харри Мартинсон
1973г.	Патрик Виктор Мартиндейл Уайт
1972г.	Генрих Белль
1971г.	Пабло Неруда
1970г.	Александр Исаевич Солженицын
1969г.	Сэмюэл Беккет
1968г.	Ясунари Кавабата
1967г.	Мигель Астуриас
1966г.	Шмуэль Йозеф Агнон
1966г.	Нелли Закс
1965г.	Михаил Александрович Шолохов
1964г.	Жан-Поль Сартр
1963г.	Георгос Сеферис
1962г.	Джон Стейнбек
1961г.	Иво Андрич
1960г.	Сен-Жон Перс
1959г.	Сальваторе Квазимодо
1958г.	Борис Леонидович Пастернак
1957г.	Альбер Камю
1956г.	Хуан Рамон Хименес
1955г.	Хальдоур Кильян Лакснесс
1954г.	Эрнест Миллер Хемингуэй
1953г.	Уинстон Леонард Спенсер Черчилль
1952г.	Франсуа Мориак
1951г.	Пер Фабиан Лагерквист
1950г.	Бертран Рассел
1949г.	Уильям Фолкнер
1948г.	Томас Стернз Элиот
1947г.	Андре Жид
1946г.	Герман Гессе
1945г.	Габриела Мистраль
1944г.	Йоханнес Йенсен
1939г.	Франс Эмиль Силланпя
1938г.	Перл Бак
1937г.	Роже Мартен Дю Гар
1936г.	Юджин ОНил
1934г.	Луиджи Пиранделло
1933г.	Иван Алексеевич Бунин
1932г.	Джон Голсуорси
1931г.	Эрик Карлфельдт
1930г.	Синклер Льюис
1929г.	Томас Манн
1928г.	Сигрид Унсет
1927г.	Анри Бергсон
1926г.	Грация Деледда
1925г.	Джордж Бернард Шоу
1924г.	Владислав Станислав Реймонт
1923г.	Уильям Батлер Йитс
1922г.	Хасинто Бенавенте - И - Мартинес
1921г.	Анатоль Франс
1920г.	Кнут Гамсун
1919г.	Карл Фридрих Георг Шпиттелер
1917г.	Карл Адольф Гьеллеруп
1917г.	Хенрик Понтоппидан
1916г.	Карл Густав Вернер фон Хейденстам
1915г.	Ромен Роллан
1913г.	Рабиндранат Тагор
1912г.	Герхардт Гауптман
1911г.	Морис Метерлинк
1910г.	Пауль Йоханн Людвиг фон Хейзе
1909г.	Сельма Лагерлеф
1908г.	Рудольф Кристоф Эйкен
1907г.	Джозеф Редьярд Киплинг
1906г.	Джозуэ Кардуччи
1905г.	Генрик Сенкевич
1904г.	Фредерик Мистраль
1904г.	Хосе Мария Вальдо Эчегарай - И - Эйсагирре
1903г.	Бьернстерне Мартиниус Бьернсон
1902г.	Теодор Моммзен
1901г.	Рене Сюлли-Прюдом

}
year = input()